leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5644A_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

#ifndef _MPC5644APORTS_H
#define _MPC5644APORTS_H


/* Pad: 75*/
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 75*/
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 75*/
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 76*/
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 76*/
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 76*/
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 77*/
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 77*/
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 77*/
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 78*/
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 78*/
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 78*/
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 79*/
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 79*/
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 79*/
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 80*/
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 80*/
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 80*/
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 81*/
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 81*/
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 81*/
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 82*/
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 82*/
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 82*/
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 83*/
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 83*/
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_CAN PORT_FUNC1

/* Pad: 83*/
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 84*/
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 84*/
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_CAN PORT_FUNC1

/* Pad: 84*/
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 85*/
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 85*/
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_CAN PORT_FUNC1

/* Pad: 85*/
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 85*/
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER0 PORT_FUNC3

/* Pad: 86*/
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 86*/
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_CAN PORT_FUNC1

/* Pad: 86*/
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 86*/
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER0 PORT_FUNC3

/* Pad: 87*/
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 87*/
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_CAN PORT_FUNC1

/* Pad: 87*/
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 88*/
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 88*/
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_CAN PORT_FUNC1

/* Pad: 88*/
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 89*/
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 89*/
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 89*/
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 90*/
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 90*/
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 90*/
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 91*/
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 91*/
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 91*/
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 92*/
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 92*/
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 92*/
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 98*/
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 98*/
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 99*/
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 99*/
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 102*/
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 102*/
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 102*/
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 103*/
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 103*/
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 103*/
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 104*/
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 104*/
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 104*/
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 105*/
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 105*/
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 105*/
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER0 PORT_FUNC2

