leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5644A_portdefs.h
/* Pad: 106*/
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 106*/
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 106*/
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 107*/
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 107*/
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 107*/
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 108*/
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 108*/
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 108*/
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 109*/
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 109*/
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 109*/
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 110*/
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 110*/
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 110*/
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 114*/
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 114*/
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 114*/
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 114*/
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 115*/
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 115*/
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 115*/
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 116*/
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 116*/
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 116*/
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 117*/
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 117*/
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 117*/
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 118*/
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 118*/
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 118*/
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 118*/
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_FLEXRAY PORT_FUNC4

/* Pad: 119*/
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 119*/
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 119*/
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 119*/
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 119*/
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_FLEXRAY PORT_FUNC4

/* Pad: 120*/
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 120*/
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 120*/
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 120*/
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 120*/
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_FLEXRAY PORT_FUNC4

/* Pad: 121*/
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 121*/
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 121*/
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 121*/
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 121*/
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER3 PORT_FUNC4

/* Pad: 122*/
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 122*/
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 122*/
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 122*/
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 123*/
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 123*/
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 123*/
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 123*/
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 124*/
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 124*/
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 124*/
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 124*/
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 125*/
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 125*/
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 125*/
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 125*/
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 126*/
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 126*/
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 126*/
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 126*/
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 127*/
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 127*/
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 127*/
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 128*/
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 128*/
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 128*/
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 128*/
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 128*/
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_OTHER2 PORT_FUNC4

/* Pad: 129*/
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 129*/
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 129*/
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 129*/
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_OTHER1 PORT_FUNC3

