leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5644A_portdefs.h
/* Pad: 130*/
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 130*/
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 130*/
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 130*/
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 131*/
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 131*/
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 131*/
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 131*/
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 132*/
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 132*/
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 132*/
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 132*/
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 133*/
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 133*/
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 133*/
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 133*/
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 134*/
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 134*/
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 134*/
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 134*/
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 134*/
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_FLEXRAY PORT_FUNC4

/* Pad: 135*/
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 135*/
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 135*/
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 135*/
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 135*/
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_FLEXRAY PORT_FUNC4

/* Pad: 136*/
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 136*/
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 136*/
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 136*/
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 137*/
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 137*/
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 137*/
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 137*/
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 137*/
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_FLEXRAY PORT_FUNC4

/* Pad: 138*/
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 138*/
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 138*/
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 138*/
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 139*/
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 139*/
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 139*/
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 139*/
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 140*/
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 140*/
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 140*/
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 140*/
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 141*/
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 141*/
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 141*/
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 141*/
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 141*/
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_OTHER2 PORT_FUNC4

/* Pad: 142*/
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 142*/
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 142*/
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 142*/
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 143*/
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 143*/
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 143*/
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 143*/
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 144*/
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 144*/
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 144*/
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 144*/
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 145*/
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 145*/
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 145*/
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 145*/
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 179*/
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 179*/
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 179*/
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 179*/
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 180*/
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 180*/
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 180*/
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 181*/
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 181*/
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 181*/
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 181*/
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 182*/
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 182*/
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 182*/
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_OTHER1 PORT_FUNC2

