leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/MPC5644A_portdefs.h
/* Pad: 183*/
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 183*/
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 183*/
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 183*/
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 185*/
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 185*/
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 185*/
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 186*/
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 186*/
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 186*/
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 187*/
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 187*/
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 187*/
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 187*/
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 188*/
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 188*/
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 188*/
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 188*/
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 189*/
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 189*/
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 189*/
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 189*/
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 190*/
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 190*/
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 190*/
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 190*/
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 191*/
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 191*/
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 191*/
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 191*/
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 192*/
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 192*/
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 192*/
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 193*/
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 193*/
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 193*/
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 193*/
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 194*/
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 194*/
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 194*/
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 202*/
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 202*/
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 206*/
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 207*/
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 208*/
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 208*/
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 208*/
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 208*/
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_ADC PORT_FUNC3

/* Pad: 212*/
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 212*/
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 212*/
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 212*/
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_ADC PORT_FUNC3

/* Pad: 213*/
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 213*/
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 213*/
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 213*/
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 215*/
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_ADC PORT_FUNC0

/* Pad: 215*/
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 215*/
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 215*/
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 216*/
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_ADC PORT_FUNC0

/* Pad: 216*/
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 216*/
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 216*/
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 217*/
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_ADC PORT_FUNC0

/* Pad: 217*/
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 217*/
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 217*/
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER2 PORT_FUNC3

/* Pad: 218*/
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_ADC PORT_FUNC1

/* Pad: 218*/
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 218*/
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER1 PORT_FUNC3

/* Pad: 219*/
/* NOTE: SIU_PCR219 has no PA field so this here only to be able to use pin as DIO */
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 220*/
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 221*/
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 222*/
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 223*/
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 224*/
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 225*/
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 227*/
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 228*/
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 230*/
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 231*/
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER0 PORT_FUNC1

/* Pad: 232*/
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_OTHER0 PORT_FUNC1

#endif  /* _MPC5644APORTS_H*/ 
